/* 1953729 信09 吴浩泽 */
#include <iostream>
#include <iomanip>
using namespace std;

#define STUDENT_NUM	4
#define SCORE_NUM	5

/* --- 不允许定义任何形式的全局变量 --- */

/***************************************************************************
  函数名称：
  功    能：求第一门课的平均分
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void average(int(*score)[STUDENT_NUM])
{
	/* 函数定义语句部分：
	   1、本函数中仅允许定义 1个简单变量 + 1个指针变量 */
	int sum = 0, * p = *score;
	/* 函数执行语句部分：
	   1、不允许再定义任何类型的变量，包括 for (int i=0;...）等形式定义变量
	   2、循环变量必须是指针变量，后续语句中不允许出现[]形式访问数组
		  不允许：int a[10], i;
				  for(i=0; i<10; i++)
					  cout << a[i];
		  允许  ：int a[10], p;
				  for(p=a; p<a+10; p++)
					  cout << *p;          */
	for (; p - *score <= 3; p++)
	{
		sum += *p;
	}
	cout << sum / 4.0 << endl;
}

/***************************************************************************
  函数名称：
  功    能：找出有两门以上课程不及格的学生
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void fail(int(*score)[STUDENT_NUM])
{
	/* 函数定义语句部分：
	   1、本函数中仅允许定义 3个简单变量 + 1个行指针变量 + 1个简单指针变量 */
	int(*p1)[4] = score;
	int* p2 = *score;
	int num = 0;
	int sum = 0;
	int i = 0;
	/* 函数执行语句部分（要求同average）*/
	for (; i <= 3; i++)
	{
		num = 0;
		sum = 0;
		p1 = score;
		for (; p1 - score <= 4; p1++)
		{
			p2 = *p1 + i;
			if (*p2 < 60)
				num++;
			sum += *p2;
		}
		if (num >= 2)
		{
			cout << "No：" << i + 1 << ' ';
			p1 = score;
			for (; p1 - score <= 4; p1++)
			{
				p2 = *p1 + i;
				cout << *p2 << ' ';
			}
			cout << "平均：" << sum / 5.0 << endl;
		}
	}
	cout << endl;
}

/***************************************************************************
  函数名称：
  功    能：找出平均成绩在90分以上或全部成绩在85分以上的学生
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void good(int(*score)[STUDENT_NUM])
{
	/* 函数定义语句部分：
	   1、本函数中仅允许定义 3个简单变量 + 1个行指针变量 + 1个简单指针变量 */
	int(*p1)[4] = score;
	int* p2 = *score;
	int num = 0;
	int sum = 0;
	int i = 0;
	   /* 函数执行语句部分（要求同average）*/
	for (; i <= 3; i++)
	{
		num = 0;
		sum = 0;
		p1 = score;
		for (; p1 - score <= 4; p1++)
		{
			p2 = *p1 + i;
			if (*p2 >= 85)
				num++;
			sum += *p2;
		}
		if (num == 5 || sum / 5.0 >= 90)
		{
			cout << "No：" << i + 1 << ' ';
			p1 = score;
			for (; p1 - score <= 4; p1++)
			{
				p2 = *p1 + i;
				cout << *p2 << ' ';
			}
			cout << "平均：" << sum / 5.0 << endl;
		}
	}
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	int a[SCORE_NUM][STUDENT_NUM] = {
		{91,92,93,97},  //第1-4个学生的第1门课成绩
		{81,82,83,85},  //第1-4个学生的第2门课成绩
		{71,72,99,87},  //第1-4个学生的第3门课成绩
		{61,32,80,91},  //第1-4个学生的第4门课成绩
		{51,52,95,88} };//第1-4个学生的第5门课成绩
	/* 除上面的预置数组外，本函数中仅允许定义 1个行指针变量 + 1个简单指针变量 */
	int(*p1)[4] = a;
	int* p2 = a[0];
	/* 函数执行语句部分（要求同average）*/
	cout << "初始信息：" << endl;
	for (; p1 - a <= 4; p1++)
	{
		cout << "No.1-4学生的第" << p1 - a + 1 << "门课的成绩：";
		for (; p2 - *p1 <= 3; p2++)
		{
			cout << *p2 << ' ';
		}
		cout << endl;
	}
	p1 = a;
	p2 = a[0];
	cout << endl << "第1门课平均分：";
	average(p1);
	cout << endl;
	cout << "2门以上不及格的学生：" << endl;
	fail(p1);
	cout << "平均90以上或全部85以上的学生：" << endl;
	good(p1);
	return 0;
}