/* 1953729 信09 吴浩泽 */
#include <iostream>
#include <limits>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：根据利润计算奖金（四舍五入，精确到元）
  输入参数：
  返 回 值：
  说    明：只允许用switch-case语句，用if语句则得分为0
***************************************************************************/
int calc_bonus(int profit)
{
    int a;
    switch (profit / 100000)
    {
        case 0:
            a = ((profit / 10.0) * 2 + 1) / 2;
            break;
        case 1:
            a = 100000 * 0.1 + ((profit - 100000) * 0.075 * 2 + 1) / 2;
            break;
        case 2:
        case 3:
            a = 100000 * 0.1 + 100000 * 0.075 + ((profit - 200000) * 0.05 * 2 + 1) / 2;
            break;
        case 4:
        case 5:
            a = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + ((profit - 400000) * 0.03 * 2 + 1) / 2;
            break;
        case 6:
        case 7:
        case 8:
        case 9:
            a = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + ((profit - 600000) * 0.015 * 2 + 1) / 2;
            break;
        default:
            a = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + ((profit - 1000000) * 0.01 * 2 + 1) / 2;
            break;
    }
    return a;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：从键盘读取一个int型正整数
  返 回 值：
  说    明：
***************************************************************************/
int get_business_profit()
{
    int x;
    while (1)
    {
        
        cout << "请输入利润" << endl;
        cin >> x;
        while (cin.fail())
        {
            cin.clear();
            cin.ignore(numeric_limits<std::streamsize>::max(), '\n');
            cout << "请输入利润" << endl;
            cin >> x;
        }
        if (x >= 1 && x <= 2147483647)
            break;
    }
    return x;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
    int profit;

    profit = get_business_profit();
    cout << "应发奖金数 : " << calc_bonus(profit) << endl;

    return 0;
}